// Минимальный максимум среди всех локальных максимумов
// [The minimum maximum among all local maxima].
// 
// Дана математическая прямоугольная матрица размером N на M.
// Необходимо разработать функцию (или программу), которая 
// находит значение локального максимума, который является
// минимальным среди всех локальных максимумов. 
// Если данные матрицы указаны неверно, то функция (программа) должна
// возвращать нулевые значения.

#include "logic.h"

int get_min_maximum(int** matrix, int n, int m) {
	return 0;
}